## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-04T23:39:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:6/invocations" -> (known after apply)
      ~ s3_key                         = "builds/0d7aa25913d67b76b7d321d1011e2feac2247fb6a137c63b7cead14dba3aaf2f.zip" -> "builds/2f70e64b4a5dd2c43963657d4a4c3d17cd815612a5d4de6268f2c00041b78f23.zip"
      ~ s3_object_version              = "oXZM8uh4ReQTw6OnUNvF6x87Dkiky8c." -> (known after apply)
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:3bf2ccf2aa6aab907cda63056b5f0c10223321c9,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:8867fc3fac314a1ae6524e54e6acaf91a3f8f62d,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "3bf2ccf2aa6aab907cda63056b5f0c10223321c9" -> "8867fc3fac314a1ae6524e54e6acaf91a3f8f62d"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "6" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "893c9fa51a0fbfa7c092ed78f164ad74-2" -> (known after apply)
      ~ id                     = "builds/0d7aa25913d67b76b7d321d1011e2feac2247fb6a137c63b7cead14dba3aaf2f.zip" -> (known after apply)
      ~ key                    = "builds/0d7aa25913d67b76b7d321d1011e2feac2247fb6a137c63b7cead14dba3aaf2f.zip" -> "builds/2f70e64b4a5dd2c43963657d4a4c3d17cd815612a5d4de6268f2c00041b78f23.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/0d7aa25913d67b76b7d321d1011e2feac2247fb6a137c63b7cead14dba3aaf2f.zip" -> "builds/2f70e64b4a5dd2c43963657d4a4c3d17cd815612a5d4de6268f2c00041b78f23.zip"
-       tags                   = {} -> null
      ~ version_id             = "oXZM8uh4ReQTw6OnUNvF6x87Dkiky8c." -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/2f70e64b4a5dd2c43963657d4a4c3d17cd815612a5d4de6268f2c00041b78f23.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/2f70e64b4a5dd2c43963657d4a4c3d17cd815612a5d4de6268f2c00041b78f23.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5863826796403802364" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0d7aa25913d67b76b7d321d1011e2feac2247fb6a137c63b7cead14dba3aaf2f.zip" -> "builds/2f70e64b4a5dd2c43963657d4a4c3d17cd815612a5d4de6268f2c00041b78f23.zip"
          ~ "timestamp" = "1680651546436323800" -> "1680710304602335000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8150958668282300368" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/0d7aa25913d67b76b7d321d1011e2feac2247fb6a137c63b7cead14dba3aaf2f.zip" -> "builds/2f70e64b4a5dd2c43963657d4a4c3d17cd815612a5d4de6268f2c00041b78f23.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-04T23:39:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:5/invocations" -> (known after apply)
      ~ s3_key                         = "builds/c3980d4f6a781ff5402705525ff16f61578ccaafe06f1386af6129643a1c4c49.zip" -> "builds/72d1966ad594a7ff63f872d9a19ceae0bc92a0aa19d43a967683947d111e2686.zip"
      ~ s3_object_version              = "kWOpsflz3DafqRJDCirFcxnr4DZheR63" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:3bf2ccf2aa6aab907cda63056b5f0c10223321c9,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:8867fc3fac314a1ae6524e54e6acaf91a3f8f62d,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "3bf2ccf2aa6aab907cda63056b5f0c10223321c9" -> "8867fc3fac314a1ae6524e54e6acaf91a3f8f62d"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "5" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "fa9620a5328b488c6ab0188e55df2a4a-2" -> (known after apply)
      ~ id                     = "builds/c3980d4f6a781ff5402705525ff16f61578ccaafe06f1386af6129643a1c4c49.zip" -> (known after apply)
      ~ key                    = "builds/c3980d4f6a781ff5402705525ff16f61578ccaafe06f1386af6129643a1c4c49.zip" -> "builds/72d1966ad594a7ff63f872d9a19ceae0bc92a0aa19d43a967683947d111e2686.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/c3980d4f6a781ff5402705525ff16f61578ccaafe06f1386af6129643a1c4c49.zip" -> "builds/72d1966ad594a7ff63f872d9a19ceae0bc92a0aa19d43a967683947d111e2686.zip"
-       tags                   = {} -> null
      ~ version_id             = "kWOpsflz3DafqRJDCirFcxnr4DZheR63" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/72d1966ad594a7ff63f872d9a19ceae0bc92a0aa19d43a967683947d111e2686.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/72d1966ad594a7ff63f872d9a19ceae0bc92a0aa19d43a967683947d111e2686.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5877902307248206520" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c3980d4f6a781ff5402705525ff16f61578ccaafe06f1386af6129643a1c4c49.zip" -> "builds/72d1966ad594a7ff63f872d9a19ceae0bc92a0aa19d43a967683947d111e2686.zip"
          ~ "timestamp" = "1680651546313597000" -> "1680710304545955800"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6348444855548281309" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/c3980d4f6a781ff5402705525ff16f61578ccaafe06f1386af6129643a1c4c49.zip" -> "builds/72d1966ad594a7ff63f872d9a19ceae0bc92a0aa19d43a967683947d111e2686.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 6 to change, 8 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4620435974)*